SetSketchyLines Method
 Sets the sketchy lines settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void SetSketchyLines(
	ViewDisplaySketchyLines sketchyLines
)
Visual Basic
Public Sub SetSketchyLines ( _
	sketchyLines As ViewDisplaySketchyLines _
)
Visual C++
public:
void SetSketchyLines(
	ViewDisplaySketchyLines^ sketchyLines
)
Parameters
sketchyLines
Type: Autodesk.Revit.DBViewDisplaySketchyLines
 Sketchy Lines settings to set.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsInvalidOperationException |  This view does not contain display-related properties.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →